{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 10, 41], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "time_distributed_6", "class_name": "TimeDistributed", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 41], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "bidirectional_11", "class_name": "Bidirectional", "config": {"name": "bidirectional_11", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_11", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["bidirectional_11", 0, 0]]}}}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "bidirectional_12", "class_name": "Bidirectional", "config": {"name": "bidirectional_12", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_12", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional_12", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_12", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_12/forward_gru_12/kernel", "shape": [64, 96], "dtype": "float32"}, {"name": "bidirectional_12/forward_gru_12/recurrent_kernel", "shape": [32, 96], "dtype": "float32"}, {"name": "bidirectional_12/forward_gru_12/bias", "shape": [96], "dtype": "float32"}, {"name": "bidirectional_12/backward_gru_12/kernel", "shape": [64, 96], "dtype": "float32"}, {"name": "bidirectional_12/backward_gru_12/recurrent_kernel", "shape": [32, 96], "dtype": "float32"}, {"name": "bidirectional_12/backward_gru_12/bias", "shape": [96], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [1], "dtype": "float32"}, {"name": "bidirectional_11/forward_gru_11/kernel", "shape": [41, 96], "dtype": "float32"}, {"name": "bidirectional_11/forward_gru_11/recurrent_kernel", "shape": [32, 96], "dtype": "float32"}, {"name": "bidirectional_11/forward_gru_11/bias", "shape": [96], "dtype": "float32"}, {"name": "bidirectional_11/backward_gru_11/kernel", "shape": [41, 96], "dtype": "float32"}, {"name": "bidirectional_11/backward_gru_11/recurrent_kernel", "shape": [32, 96], "dtype": "float32"}, {"name": "bidirectional_11/backward_gru_11/bias", "shape": [96], "dtype": "float32"}]}]}