{  
    "format":"layers-model",
    "generatedBy":"keras v2.2.4",
    "convertedBy":"TensorFlow.js Converter v1.0.1",
    "modelTopology":{  
       "keras_version":"2.2.4",
       "backend":"tensorflow",
       "model_config":{  
          "class_name":"Sequential",
          "config":{  
             "name":"sequential_7",
             "layers":[  
                {  
                   "class_name":"Bidirectional",
                   "config":{  
                      "name":"bidirectional_1",
                      "trainable":true,
                      "layer":{  
                         "class_name":"GRU",
                         "config":{  
                            "name":"gru_1",
                            "trainable":true,
                            "batch_input_shape":[  
                               1,
                               60,
                               92
                            ],
                            "dtype":"float32",
                            "return_sequences":false,
                            "return_state":false,
                            "go_backwards":false,
                            "stateful":false,
                            "unroll":false,
                            "units":32,
                            "activation":"tanh",
                            "recurrent_activation":"hard_sigmoid",
                            "use_bias":true,
                            "kernel_initializer":{  
                               "class_name":"VarianceScaling",
                               "config":{  
                                  "scale":1.0,
                                  "mode":"fan_avg",
                                  "distribution":"uniform",
                                  "seed":null
                               }
                            },
                            "recurrent_initializer":{  
                               "class_name":"Orthogonal",
                               "config":{  
                                  "gain":1.0,
                                  "seed":null
                               }
                            },
                            "bias_initializer":{  
                               "class_name":"Zeros",
                               "config":{  
 
                               }
                            },
                            "kernel_regularizer":null,
                            "recurrent_regularizer":null,
                            "bias_regularizer":null,
                            "activity_regularizer":null,
                            "kernel_constraint":null,
                            "recurrent_constraint":null,
                            "bias_constraint":null,
                            "dropout":0.0,
                            "recurrent_dropout":0.0,
                            "implementation":1,
                            "reset_after":false
                         }
                      },
                      "merge_mode":"concat"
                   }
                },
                {  
                   "class_name":"Dense",
                   "config":{  
                      "name":"dense_6",
                      "trainable":true,
                      "units":1,
                      "activation":"sigmoid",
                      "use_bias":true,
                      "kernel_initializer":{  
                         "class_name":"VarianceScaling",
                         "config":{  
                            "scale":1.0,
                            "mode":"fan_avg",
                            "distribution":"uniform",
                            "seed":null
                         }
                      },
                      "bias_initializer":{  
                         "class_name":"Zeros",
                         "config":{  
 
                         }
                      },
                      "kernel_regularizer":null,
                      "bias_regularizer":null,
                      "activity_regularizer":null,
                      "kernel_constraint":null,
                      "bias_constraint":null
                   }
                }
             ],
             "build_input_shape":[  
                1,
                60,
                92
             ]
          }
       },
       "training_config":{  
          "optimizer_config":{  
             "class_name":"Adam",
             "config":{  
                "lr":0.0010000000474974513,
                "beta_1":0.8999999761581421,
                "beta_2":0.9990000128746033,
                "decay":0.0,
                "epsilon":1e-07,
                "amsgrad":false
             }
          },
          "loss":"binary_crossentropy",
          "metrics":[  
             "accuracy"
          ],
          "sample_weight_mode":null,
          "loss_weights":null
       }
    },
    "weightsManifest":[  
       {  
          "paths":[  
             "group1-shard1of1.bin"
          ],
          "weights":[  
             {  
                "name":"bidirectional_1/forward_gru_1/kernel",
                "shape":[  
                   92,
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"bidirectional_1/forward_gru_1/recurrent_kernel",
                "shape":[  
                   32,
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"bidirectional_1/forward_gru_1/bias",
                "shape":[  
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"bidirectional_1/backward_gru_1/kernel",
                "shape":[  
                   92,
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"bidirectional_1/backward_gru_1/recurrent_kernel",
                "shape":[  
                   32,
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"bidirectional_1/backward_gru_1/bias",
                "shape":[  
                   96
                ],
                "dtype":"float32"
             },
             {  
                "name":"dense_6/kernel",
                "shape":[  
                   64,
                   1
                ],
                "dtype":"float32"
             },
             {  
                "name":"dense_6/bias",
                "shape":[  
                   1
                ],
                "dtype":"float32"
             }
          ]
       }
    ]
 }
